Revit 2027 API
FormatOptions.SetSymbolTypeId Method
 Sets the symbol that should be displayed to indicate the unit quantifying the value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSymbolTypeId(
	ForgeTypeId symbolTypeId
)
Public Sub SetSymbolTypeId (
	symbolTypeId As ForgeTypeId
)
public:
void SetSymbolTypeId(
	ForgeTypeId^ symbolTypeId
)
member SetSymbolTypeId :
        symbolTypeId : ForgeTypeId -> unit
Parameters
symbolTypeId ForgeTypeId
 The symbol identifier. An empty identifier string indicates no symbol.
Exceptions
Exception | Condition
ArgumentException |  symbolTypeId is not a valid symbol for the unit in this FormatOptions.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace